# Taps
tap "anomalyco/tap"
tap "gentleman-programming/tap"

# Development Essentials
brew "git"
brew "wget"
brew "curl"
brew "tree"

# Node.js & Version Management
brew "node@24", link: true
brew "nvm"

# Shell & Utilities
brew "bash"
brew "starship"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Git Utilities  
brew "git-lfs"
brew "gh"
brew "tig"
brew "git-delta"

# CLI Tools
brew "bat"
brew "direnv"
brew "exiftool"
brew "eza"
brew "fd"
brew "fzf"
brew "htop"
brew "jq"
brew "ncdu"
brew "ripgrep"
brew "tldr"
brew "zoxide"

# Compression
brew "xz"
brew "p7zip"

# Databases
brew "mysql"
brew "mysql-client@8.0"
brew "postgresql@15"
brew "redis"

# DevOps & Cloud
brew "awscli"
brew "docker"
brew "docker-compose"
brew "terraform"
cask "docker-desktop"

# Programming Languages & Environments
brew "go"
brew "openjdk@17"
brew "pipx"
brew "pyenv"
brew "python@3.11"
brew "python@3.13"

# iOS & Mobile Development
brew "cocoapods"
brew "xcodegen"
brew "xcodes"

# AI & AI Agents
brew "ollama", restart_service: :changed
brew "anomalyco/tap/opencode"
brew "gentleman-programming/tap/engram"
brew "gentleman-programming/tap/gentle-ai"
brew "gentleman-programming/tap/gga"

# Security & Forensics
brew "bfg"
brew "gitleaks"
brew "pre-commit"
brew "bkcrack"
brew "john-jumbo"

# Utilities
brew "ffmpeg"
brew "imagemagick"
brew "qrencode"
brew "yt-dlp"

# Applications
cask "android-studio"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "postman"
cask "visual-studio-code"
cask "warp"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"

# VS Code Extensions
vscode "bierner.markdown-mermaid"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "jripouteau.adonis-vscode-extension"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
