bierner.markdown-mermaid
continue.continue
davidanson.vscode-markdownlint
eamodio.gitlens
github.copilot
github.copilot-chat
google.geminicodeassist
jripouteau.adonis-vscode-extension
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.vscode-typescript-next
openai.chatgpt
redhat.vscode-yaml
saoudrizwan.claude-dev
vue.volar
yoavbls.pretty-ts-errors
golang.go
